Конвертация_данных_31_демо.Conversion_3_Plus/src/InformationRegisters/Расш1_ТекстыМодулей/Расш1_ТекстыМодулей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_ТекстыМодулей</name>
  <comment>Тексты модулей релиза для подсказок консоли</comment>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Глобальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.Расш1_ВидыМодулей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конвертация_данных_31_демо.Conversion_3_Plus/src/CommonForms/Расш1_ПросмотрТекстаМодуля/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Релиз) Или ПустаяСтрока(Параметры.Ключ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Текст = ТекстМодуля(Параметры.Релиз, Параметры.Вид, Параметры.Ключ);
	АвтоЗаголовок = Ложь;
	Заголовок = Параметры.Ключ;
	
	Если Не Расш1_КонсольКодаВызовСервера.КонсольВключена() Тогда
		Возврат;
	КонецЕсли;
	
	Опции = Расш1_КонсольКодаКлиентСервер.НовыйОписаниеАлгоритма();
	Опции.ИмяСтраницы = "Текст";
	Опции.ТолькоПросмотр = Истина;
	Опции.ПоказыватьНаправление = Ложь;
	Опции.СкрытьПанельКоманд = Истина;
	Расш1_КонсольКода.ЗарегистрироватьАлгоритм(ЭтотОбъект, Элементы.Текст, Опции);
	Расш1_КонсольКода.СоздатьХостКонсоли(ЭтотОбъект, ЭтотОбъект, "", Элементы.Текст);
	Расш1_КонсольКода.ЗаполнитьРеквизитыПоиска(
		ЭтотОбъект,
		Параметры.Расш1_ФразаПоиска,
		"Текст",
		Параметры.Расш1_НомерСтрокиПоиска);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.Найти(Расш1_КонсольКодаКлиентСервер.ИмяЭлементаХостаКонсоли()) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Расш1_КонсольКодаКлиент.ПоказатьАлгоритм(ЭтотОбъект, "Текст");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольДокументСформирован(Элемент)
	
	Расш1_КонсольКодаКлиент.ИнициализироватьКонсоль(ЭтотОбъект, Элемент);
	Расш1_КонсольКодаКлиент.ВыделитьФразуПоиска(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Расш1_Подключаемый_КонсольПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Расш1_КонсольКодаКлиент.ПриНажатии(ЭтотОбъект, ДанныеСобытия, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Расш1_Подключаемый_КомандаКонсоли(Команда)
	
	Расш1_КонсольКодаКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Подменю командной панели к этому моменту уже закрыто.
//
&НаКлиенте
Процедура Расш1_Подключаемый_ПоказатьЗакладки()
	
	Расш1_КонсольКодаКлиент.ПоказатьСписокЗакладокСейчас(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстМодуля(Релиз, Вид, Ключ)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Релиз", Релиз);
	Отбор.Вставить("Вид", Вид);
	Отбор.Вставить("Ключ", Ключ);
	Запись = РегистрыСведений.Расш1_ТекстыМодулей.Получить(Отбор);
	Возврат Запись.Текст;
	
КонецФункции

#КонецОбласти
